In [2]:
import pandas as pd
import queries_db_script as que
import mysql
pd.set_option('display.max_columns', None)

## These are tests of the queries that we created

## In queries that ask for genre, you can use one of the following as you wish:
Drama, Documentary, Comedy, Sci-Fi, Action, Short, Fantasy, Biography, Crime, War, Family, Animation

## In queries that ask for actor names, it doesn't matter if it's upper or lower case

## Query 1

In [3]:
que.query_1("Drama")

       MovieID                    Genre                        Title
0          230             Drama, Short                   Cinderella
1          488    Short, Drama, Fantasy   The Land Beyond the Sunset
2          498     Short, Drama, Family             Rescued by Rover
3          574  Biography, Crime, Drama  The Story of the Kelly Gang
4          832             Short, Drama            A Corner in Wheat
...        ...                      ...                          ...
21222  4991384                    Drama                Interrogation
21223  4991590                    Drama                 Interruption
21224  4991660                    Drama                The Black Hen
21225  5005684            Drama, Family            The New Classmate
21226  5013980    Biography, Drama, War       Die Turnschuh-Giganten

[21227 rows x 3 columns]

## Query 2
You can choose years between 1990 and 2015

In [4]:
que.query_2(1995,2005)

,MovieID,Title,Year,IMDbRating,Awards
0,105601,Titanica,1995,6.5,1 nomination.
1,107070,Halbe Welt,1995,6.5,2 wins & 1 nomination.
2,107696,A Dangerous Place,1995,5.2,None
3,108380,Trapped in Space,1995,4.9,None
4,109028,Cold Fever,1995,7.1,3 wins.
...,...,...,...,...,...
9000,2155247,Australian Atomic Confessions,2005,NaN,None
9001,2248926,Un attore contro - Gian Maria Volont�,2005,6.8,None
9002,2650192,Celestial Subway Lines/Salvaging Noise,2005,NaN,None
9003,2780668,What's Going on the Life and Death of Marvin Gaye,2005,7.6,None
9004,3645848,Crossfire: Hate Is Like a Gun,2005,NaN,None

## Query 3
Choose the minimum number of movies by year and genre as you wish

In [5]:
que.query_3(7)

       Genre  Year  Movies Number
0     Action  2008              9
1     Action  2011             11
2     Action  2014             12
3     Action  2015             39
4     Action  2016             14
..       ...   ...            ...
889  Western  1968             18
890  Western  1969             17
891  Western  1970             14
892  Western  1971             21
893  Western  1972             11

[894 rows x 3 columns]

## Query 4
You can use whatever word you think will appear in a plot of the movie

In [6]:
que.query_4("MAGIC")

       IMDBid                           Title
0         211              A Trip to the Moon
1         242           The Sign of the Cross
2         399          Jack and the Beanstalk
3         417              A Trip to the Moon
4         420             Alice in Wonderland
...       ...                             ...
2405  4240654                          Sicc�n
2406  4296026                  Avengers Grimm
2407  4462082                        Counting
2408  4653606  Nate Bargatze: Full Time Magic
2409  4789290                 A Kind of Magic

[2410 rows x 2 columns]

## Query 5
Choose minimum number of movies above the average rating per director

In [7]:
que.query_5(3)

                                               director  movie_count
0                                  A. Edward Sutherland            4
1                                       A.R. Murugadoss            5
2     Abbas Alibhai Burmawalla, Mastan Alibhai Burma...            6
3                                      Abbas Kiarostami           19
4                                   Abdellatif Kechiche            4
...                                                 ...          ...
1336                                       Zoltan Korda            5
1337                                        �agan Irmak            6
1338                                   �douard Molinaro            6
1339                                 �lex de la Iglesia            9
1340                                  �tienne Chatiliez            4

[1341 rows x 2 columns]

## Query 6
Choose your favorite actor

In [10]:
que.query_6(actor="matt damon", start_year= 2010, end_year= 2014)

   Year  Movies Counter Average Rating per Year
0  2010              34       7.150000020861626
1  2011              34       7.150000020861626
2  2012              34       7.150000020861626
3  2013              34       7.150000020861626
4  2014              34       7.150000020861626

## Query 7

In [9]:
que.query_7("Sci-Fi")

   Year          Director                      Genre  Movies_Counter
0  2009  Fedor Bondarchuk  Action, Adventure, Sci-Fi               2
1  2012   Christopher Ray     Action, Horror, Sci-Fi               2
2  2014    Kazuchika Kise  Animation, Action, Sci-Fi               2